{
    "testimonials": [
      {
        "name": "Paul L",
        "content": "UNMATCHED! And a fricking LIFE HACK! Hands down the most transformative program I've ever been on!! Not only has Tim concentrated on helping me improve my physical health (I was in it for a banging bikini body at first ngl lol) with a personalised plan, he also teaches you how to reprogram your entire mindset from the inside out which develops a mental strength to push through life's trickery. Holistically speaking I've gone from rags to riches ✨ I'm so enriched with genuine positivity, peace, happiness, love etc which naturally helps you tap into your higher self & start leading your life with intention to get towards your calling or \"PURPOSE\" in life.\n\nMan, the emotional intelligence I've gained from this too has taken the cup for me!\n\nTrust me when I say the tools Tim had passed on to me over the short few months I've worked with him is now my saving grace but could literally be all yours too. Best support system ever he's on standby no matter the time of day or where you are he makes it known that he's their period. Big brother tings and we all need those big brother nudges here and there to keep us in check, Tim's good at that lol Look, I've already written an essay yes, I could go on and on and on about how amazing this experience has been but all I can say is that experience your damn self! Haha\n\nI'm just so proud of Tim for developing something that has genuinely changed my life forever for the better. There's going to be some stronger, more focused, healed, successful people coming out of this! So, if this resonates with you don't muck around and get what you deserve and sign your life away. Cos I'd run this back to double back real quick haha Thank you so much Coach! Your the Goat! 🫡 🚀🚀🚀🚀🚀"
      },
      {
        "name": "Cara P",
        "content": "The past 3.5 years for me have been super challenging navigating parenthood, serious health issues, amongst other complications left me dwindling in survival mode. My mental health was shot / non-existent and I had no love for myself whatsoever. Always pouring from an empty cup.\n\nRe3 has been absolutely life changing for me! I can't stress enough how positive this experience has been so far for me. I credit this all to the best coach, Tim. You have been so supportive, patient and understanding. Consistently checking in and pushing me to be my best every single day. You have never made me feel judged or silly.\n\nThe skills you have taught me have helped me establish a solid routine which has resulted in me being a much happier person, less stressed, more present and out of that autopilot mode. I am a better Mum to my son, this program has impacted him greatly. My two year old does gratitude with me every single day! That is insane to me!\n\nMentally I feel so focused, strong and excited to be living life again and learning to love myself more everyday. My skin issues (Psoriasis & eczema) have improved drastically. I have lost weight and feel a lot less bloated and move my body every single day! I am not taking half the medication I was on before.\n\nI can't recommend the Re3 program enough! Tim's story is an absolute inspiration - He lives what he preaches and is passionate about what he does, forever celebrating you and the small wins you achieve.\n\nForever grateful the universe (Max 😃) pointed me in your direction and told me I would benefit from this! Because it has been life altering in the best possible way."
      }
    ]
  }