{
  "testimonials": [
    {
      "name": "Ari",
      "content": "UNMATCHED! And a fricking LIFE HACK! Hands down the most transformative program I've ever been on!! Not only has Tim concentrated on helping me improve my physical health (I was in it for a banging bikini body at first ngl lol) with a personalised plan, he also teaches you how to reprogram your entire mindset from the inside out which develops a mental strength to push through life's trickery. Holistically speaking I've gone from rags to riches ✨ I'm so enriched with genuine positivity, peace, happiness, love etc which naturally helps you tap into your higher self & start leading your life with intention to get towards your calling or \"PURPOSE\" in life.\n\nMan, the emotional intelligence I've gained from this too has taken the cup for me!\n\nTrust me when I say the tools Tim had passed on to me over the short few months I've worked with him is now my saving grace but could literally be all yours too. Best support system ever he's on standby no matter the time of day or where you are he makes it known that he's their period. Big brother tings and we all need those big brother nudges here and there to keep us in check, Tim's good at that lol Look, I've already written an essay yes, I could go on and on and on about how amazing this experience has been but all I can say is that experience your damn self! Haha\n\nI'm just so proud of Tim for developing something that has genuinely changed my life forever for the better. There's going to be some stronger, more focused, healed, successful people coming out of this! So, if this resonates with you don't muck around and get what you deserve and sign your life away. Cos I'd run this back to double back real quick haha Thank you so much Coach! Your the Goat! 🫡 🚀🚀🚀🚀🚀"
    },
    {
      "name": "Cara P",
      "content": "The past 3.5 years for me have been super challenging navigating parenthood, serious health issues, amongst other complications left me dwindling in survival mode. My mental health was shot / non-existent and I had no love for myself whatsoever. Always pouring from an empty cup.\n\nRe3 has been absolutely life changing for me! I can't stress enough how positive this experience has been so far for me. I credit this all to the best coach, Tim. You have been so supportive, patient and understanding. Consistently checking in and pushing me to be my best every single day. You have never made me feel judged or silly.\n\nThe skills you have taught me have helped me establish a solid routine which has resulted in me being a much happier person, less stressed, more present and out of that autopilot mode. I am a better Mum to my son, this program has impacted him greatly. My two year old does gratitude with me every single day! That is insane to me!\n\nMentally I feel so focused, strong and excited to be living life again and learning to love myself more everyday. My skin issues (Psoriasis & eczema) have improved drastically. I have lost weight and feel a lot less bloated and move my body every single day! I am not taking half the medication I was on before.\n\nI can't recommend the Re3 program enough! Tim's story is an absolute inspiration - He lives what he preaches and is passionate about what he does, forever celebrating you and the small wins you achieve.\n\nForever grateful the universe (Max 😃) pointed me in your direction and told me I would benefit from this! Because it has been life altering in the best possible way."
    },
    {
      "name": "Sonny S",
      "content": "I recently had the pleasure of completing the RE-3 12-week mindset programme with Tim, and it has been an incredibly transformative experience. Throughout the programme, Tim guided me through various tools & techniques, these practices have significantly shifted my energy and greatly improved my moods and outlook on life.\n\nTim's weekly sessions were insightful and supportive, offering personalized guidance that helped me change my mindset in profound ways. His expertise and compassionate approach made it easy to integrate these new habits into my daily life. I am deeply grateful for the positive impact this programme has had on my overall well-being. I will continue to use these tools for the rest of my life.\n\nI highly recommend Tim's mindset programme to anyone looking to enhance their mental and emotional health. It has been a truly life-changing journey."
    },
    {
      "name": "Larson",
      "content": "When I first met Tim and started the Rethree program it's fair to say my life was all over the place. My diet was terrible I was gambling every single day and my sleep patterns were atrocious. During the program I was able to learn essential tools to help keep myself grounded and organised. One of the most valuable lesson I learnt during this whole process is that even if you have a bad day or week or even two weeks you can reign it back in and get back to achieving your goals. I am definitely not perfect but the improvements I have made have been amazing. If you need to take a step in the right direction I would recommend teaming up with Tim and doing the Rethree program!"
    },
    {
      "name": "Karlos K.",
      "content": "This program has helped me in more ways than I could have imagined. I've broken through my drug and alcohol addiction, I have managed to stay sober longer than I ever have before due to the tools I have learnt along the way. I've accomplished so many goals in such a short amount of time I sold my house, bought a new house, started a new company, smashed countless fitness goals and a whole new outlook on life with a strong mindset. I'd recommend this to anyone at any stage in life. 💪"
    },
    {
      "name": "Sam B",
      "content": "Hey Team,\n\nI can't thank Tim enough for what he's done for me over the last 2-3 months, honestly. He constantly checks up on me and is there at any time of the day for when we need his guidance or if we have any questions about his structured plan that he has written out for me. My mindset has changed and my habits are changing for good and I'm moving towards implementing these changes which Tim has guided me towards forever. The plans are structured and Tim holds me accountable and is always in my corner. He has got your best interest in mind and will always look after number one, which is you. More than happy to chat to anyone about my experience and what Tim has done for me.\n\nThanks, Sam B"
    },
    {
      "name": "Alisha K",
      "content": "When Tim first reached out to me about sharing my journey with his program, I was filled with a mix of excitement and uncertainty. How could I possibly convey the profound impact his guidance has had on my life? As I sit down to recount my story, I'm overwhelmed by the depth of emotion that floods my heart.\n\nFor years, I grappled with the heavy burden of depression, a weighty legacy of childhood trauma. Despite outward appearances of success—building a home, nurturing a career, and cherishing motherhood—I found myself sinking deeper into despair with each passing day. Then, like a beacon of hope in my darkest hour, Tim entered my life, his program offering a glimmer of light in the abyss of my despair.\n\nInitially, I approached the program with skepticism, viewing it as just another attempt to mask the pain I carried within. But oh, how wrong I was! With each passing week, Tim's teachings became a lifeline, guiding me out of the depths of my despair and into a newfound sense of self-worth and resilience.\n\nOne of the greatest revelations of this journey has been the realization that true love begins with self-acceptance. I used to scoff at the notion that I couldn't love others until I loved myself, believing my love for my children was proof enough. Yet, through Tim's guidance, I've discovered a depth of self-love that transcends anything I ever thought possible. It's a love that radiates from within, infusing every aspect of my being and amplifying the love I feel for those around me.\n\nTim's wisdom and compassion have been a beacon of light on my journey, illuminating the path forward and instilling within me a newfound sense of hope and purpose. With each passing day, I feel myself growing stronger, more resilient, and more grateful for the blessings that surround me.\n\nAs I reflect on how far I've come, tears of gratitude stream down my cheeks. I am immensely grateful to Tim for his unwavering support, his profound insights, and his unwavering belief in my ability to heal and thrive. With his guidance, I feel as though I've been reborn, my heart overflowing with love, gratitude, and a newfound zest for life.\n\nI am excited for the future, filled with dreams and aspirations that once seemed out of reach. And as I look around me, I'm filled with awe and appreciation for the beauty and abundance that surrounds me. Life is truly a gift, and I am endlessly thankful for the opportunity to embrace it fully, with an open heart and a renewed sense of purpose.\n\nThank you and appreciate you. Alisha K"
    },
    {
      "name": "Anthony",
      "content": "Jumped on board because I wasn't where I wanted to be mentally. Started doing push-ups daily just to find out the bro doing the same, so I knew this is the coach I needed. Someone whose background is similar and just wanting to be better for his lil family.\n\nI felt like I had the tools I needed to become where I wanted to be, but without the right teacher these tools wouldn't be sharpened right! The one tool I didn't have that would be the greatest one of all, gratitude. Being grateful. Being grateful helped me calm right down, it helped me show empathy, as well as patience. I'm only human though and the bro knows I've messed up, but I believe with this tool it's helped me change for the better. Constant gratitude for things that are going great in my life as well as manifestations for better days to come when things ain't going so great. I've told Tim my fear of the motorway. And it's taken me 5 months to turn that negative fear into positive manifestations! The bro helped me manifest the courage to do it. I set out a couple of personal goals just to find out through this course that's not what I really wanted to do. What I really want to do is become healthy, mentally, physically, and spiritually. And I believe if I didn't jump on board I'd still be doing things that weren't adding value to my life.\n\nSo shout out to the brother Tim for helping me add structure to my life. Giving me the tools to add self-belief and self-confidence in myself again.\n\n- Anthony"
    },
    {
      "name": "Jesse Taylor",
      "content": "Enrolling in the mindset program has been very beneficial to me. It's allowed me to create a structured routine and help me set short term goals as well as long term goals. Highly recommend it for anyone trying to level up. Shot Tim!\n\n- Jesse Taylor"
    },
    {
      "name": "Terryn",
      "content": "I have had the most amazing experience during the 12-week mindset program. The support and guidance from Tim has been awesome through this whole journey. I have gained a sense of confidence in myself that has been missing for a long time and I'm so proud of the changes in myself.\n\nI was in a state of constant fight and flight and had been for years when I started this program, and my biggest goal when committing to this was to get myself out of fight or flight and to be the best mum I could be for my kids. Tim has given me the tools and help to create this change and constant growth. I am just so grateful for this experience and who I am after these past few months. Thank you so much!!!\n\n- Terryn"
    },
    {
      "name": "Milan",
      "content": "At the start of the course I had lost myself in motherhood, lost in general, had no routine, living through my inner child (which I learnt throughout this course). Smoking to run away from my emotions and had the worst anxiety, hardly left my house, didn’t go to the grocery store or talk to anyone. Almost didn’t reply to Tim’s first message but I am so glad that I did!\n\nAs someone who had been in and out of the mental health system I’ve never been offered tools like affirmations, breath work, meditation. Tim really felt like a friend throughout the 12 weeks. I would always come up to the calls feeling like I had failed the week but always left feeling so pumped, ready to smash the next week because he would remind me of how good I was doing. Constantly checking in even after the 12 weeks I genuinely feel cared for, truly an unforgettable experience. It’s safe to say I have found myself again. Getting out almost daily with my young girls, visiting friends, taking time for myself and I’m the healthiest I have ever been. I could not thank you enough. This is still just the beginning of my journey, getting 1% better every day.\n\n- Milan"
    },
    {
      "name": "William Scovell",
      "content":"To whom it may concern\nTim Max has worked alongside our rangatahi for the past three months. Three times a week he has provided a group of our students with a combination of physical and mental wellbeing sessions.\n\nTim’s obvious talent are his boxing skills along with the success he has achieved in the ring. However, his background, personality and positive nature are what make him so relatable to our young people. He instantly connected with our students and they have thrived in the supportive but challenging environment Tim has created.\n\nOur students are challenged physically, and often pushed to their limits. In the classroom they reflect on their actions and plan for a positive future. Each session has a clear purpose and outcome which allow the students to achieve and measure their success.\n\nThe influence Tim has had on our students has extended beyond his weekly sessions. Our students hold each other accountable to achieve the goals they have set and to be leaders and positive role models to their peers.\n\nNgā manaakitanga\n\nWilliam Scovell\nAssociate Principal\nTakapuna Grammar School"
    }
    ,
    {
      "name": "James Cullen",
      "content": "Marist Alternative Education provides programmes for students who are not attending mainstream school for several reasons. Some of these reasons include exclusion, non-attendance, anxiety, depression, or Youth Justice matters.\n\nTim Max has worked alongside Marist for most of the 2024 school year. Initially, he worked with our students as part of the Te Aukaha programme, and this was extended to operate within the Marist environment.\n\nTim has delivered whole-class programmes that develop goal-setting skills for our students. He revisits these regularly with the rangatahi. He has also provided opportunities for our students to express themselves through music, bringing in well-known local artists to support the rangatahi in the process.\n\nTim's unique approach has allowed him to build strong relationships with our most at-risk youth. These relationships have enabled the students to receive help and guidance from professionals and social agencies. Tim’s approach, which encourages accountability and demonstrates compassion towards the students, is truly unique and effective.\n\nTim's long-term commitment to our students is truly commendable. He understands that positive change will not happen overnight, and that consistency and regularity are key drivers of change. His flexibility to the needs of the students and to Marist as an organisation further demonstrates his dedication.\n\nJames Cullen\nPrincipal | Tumuaki\nMarist Alternative Education Limited"
    },
    {
      "name": "Austin",
      "content": "Honestly brother, my whole summary of this program is so profound. How has this program helped me? Well it has helped me mentally because the task given from you has helped me take immediate action because you went out of your way to help me no matter the circumstances or payment so I wanted to match that energy and keep the fire burning in a positive way. There is direction and purpose to my days now instead of wondering what to do being on autopilot. You gave me a task to write small wins which eventually leads to big changes, positive changes and now I structured out daily disciplines through this task and now I got high priorities with my life. Thank you for this brother and this is the summary of what I think of the program.\n\nAustin"
    }
    ,
    {
      "name": "Ari",
      "content": "Hey Tim,\n\nI wanted to say thank you for your coaching over the last 12 weeks. When we first started the programme I was struggling a lot with anxiety and depression having just come out of a traumatic breakup and had lost my sense of self and then later even losing a close relative. The tools you taught me are invaluable and easy to implement in every day life. I found even when I slumped or didn’t do as good as I wanted the compassion and encouragement (without pressure) from you helped me get back on track. Personally I found the “Small Wins” to be my favourite tool, it helped me get back into a routine and feel good/proud of achieving the littlest goals, which later led to bigger goals. But I also loved the meditation and the additional suggestions you made around procrastination. The programme pack and videos you have put together are amazing & I will continue to refer back to these. Looking forward to following more of your successes online. Wishing you & your family a merry Christmas & Happy New Year!\n\nThanks,\nAri"
    }
    
    
    
    
  ]
}
